Documents/абс_Экспедиция/абс_Экспедиция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_Экспедиция</name>
  <basedOn>Document.абс_ТранспортныйМаршрут</basedOn>
  <basedOn>Document.абс_ЗаявкаНаТранспорт</basedOn>
  <registerRecords>AccumulationRegister.абс_ЗатратыПоЭкспедиции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетаТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСчетаТК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаемныйТранспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспедиторскаяРасписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АктВыполненныхРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАкта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерЗадания</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортныйМаршрут</name>
      <type>
        <types>DocumentRef.абс_ТранспортныйМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доля</name>
      <comment>Доля расходов от суммы счета транспортной компании</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ТранспортныйМаршрут/абс_ТранспортныйМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ТранспортныйМаршрут</name>
  <attributes>
    <name>СводнаяЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_СводнаяЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.абс_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТКПеревозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоручениеЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТранспортногоМаршрута</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьДоверенность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DocumentRef.Доверенность</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ЗаявкаНаТранспорт/абс_ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаТранспорт</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактыОтветственногоМенеджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиКонтрагента</name>
    <type>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМоноПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТКНазначения</name>
    <comment>Транспортная компания назначения</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПромежуточный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоКоличествоМиксПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Номенклатура</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_Экспедиция/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция"));
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(ДокументОбъект, ЭтаФорма);
	Иначе
		// Заполнить реквизиты значениями по умолчанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект);
	КонецЕсли;
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

////////(1) Процедуры и функции ТЧ Заказы///////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаказыНомерЗаданияПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Заказы.ТекущиеДанные;
	Данные = ПолучитьДанныеСтрокиПоЗаявке(ДанныеСтроки.НомерЗадания);
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, Данные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСтрокиПоЗаявке(Заявка)
	
	Данные = Новый Структура("Контрагент, СуммаДокумента, ТранспортныйМаршрут", Справочники.Контрагенты.ПустаяСсылка(), 0, Документы.абс_ТранспортныйМаршрут.ПустаяСсылка());
	Если НЕ Заявка.Пустая() Тогда
		Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ
                       |	абс_ЗаявкаНаТранспорт.Ссылка
                       |ПОМЕСТИТЬ ВТЗаявка
                       |ИЗ
                       |	Документ.абс_ЗаявкаНаТранспорт КАК абс_ЗаявкаНаТранспорт
                       |ГДЕ
                       |	абс_ЗаявкаНаТранспорт.Ссылка = &Ссылка
                       |;
                       |
                       |////////////////////////////////////////////////////////////////////////////////
                       |ВЫБРАТЬ ПЕРВЫЕ 1
                       |	абс_ТранспортныйМаршрутЗадания.Ссылка
                       |ПОМЕСТИТЬ ТранспортныйМаршрут
                       |ИЗ
                       |	ВТЗаявка КАК ВТЗаявка
                       |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
                       |		ПО ВТЗаявка.Ссылка = абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт
                       |
                       |УПОРЯДОЧИТЬ ПО
                       |	абс_ТранспортныйМаршрутЗадания.Ссылка.МоментВремени УБЫВ
                       |;
                       |
                       |////////////////////////////////////////////////////////////////////////////////
                       |ВЫБРАТЬ
                       |	ВТЗаявка.Ссылка.Контрагент КАК Контрагент,
                       |	СУММА(ЕСТЬNULL(абс_ЗаявкаНаТранспортТовары.Сумма, 0)) КАК СуммаДокумента,
                       |	ТранспортныйМаршрут.Ссылка КАК ТранспортныйМаршрут
                       |ИЗ
                       |	ВТЗаявка КАК ВТЗаявка
                       |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ЗаявкаНаТранспорт.Товары КАК абс_ЗаявкаНаТранспортТовары
                       |		ПО ВТЗаявка.Ссылка = абс_ЗаявкаНаТранспортТовары.Ссылка
                       |		ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныйМаршрут КАК ТранспортныйМаршрут
                       |		ПО (ИСТИНА)
                       |
                       |СГРУППИРОВАТЬ ПО
                       |	ВТЗаявка.Ссылка.Контрагент,
                       |	ТранспортныйМаршрут.Ссылка";
		
		Запрос.Параметры.Вставить("Ссылка", Заявка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура РаспределитьРасходы(Команда)
	
	РаспределитьРасходыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьРасходыНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция"));
	ДокументОбъект.РаспределитьРасходы();	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТранспортномуМаршруту(Команда)
	абс_Транспортныймаршрут = ОткрытьФормуМодально("Документ.абс_ТранспортныйМаршрут.ФормаВыбора");
	Если Не абс_Транспортныймаршрут = Неопределено Тогда
		ЗаполнитьПоМаршрутуНаСервере(абс_Транспортныймаршрут);
	КонецЕСлИ;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоМаршрутуНаСервере(ТранспортныйМаршрут)
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт
	//	|ИЗ
	//	|	Документ.абс_СводнаяЗаявкаНаТранспорт.Маршруты КАК абс_СводнаяЗаявкаНаТранспортМаршруты
	//	|ГДЕ
	//	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут = &ТранспортныйМаршрут";  
	//Запрос.УстановитьПараметр("ТранспортныйМаршрут", ТранспортныйМаршрут); 
	//Результат = Запрос.Выполнить();     
	//ВыборкаДетальныеЗаписи = Результат.Выбрать(); 
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	СтрокиСМаршрутом = Объект.Заказы.НайтиСтроки(Новый Структура("НомерЗадания", ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт));
	//	Если СтрокиСМаршрутом.Количество() = 0 Тогда
	//		НоваяСтрока = Объект.Заказы.Добавить();
	//		НоваяСтрока.НомерЗадания = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт;
	//		НоваяСтрока.Контрагент = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт.Контрагент;
	//		НоваяСтрока.СуммаДокумента = ВыборкаДетальныеЗаписи.ЗаявкаНаТранспорт.СуммаДокумента;
	//		НоваяСтрока.ТранспортныйМаршрут = ТранспортныйМаршрут;
	//	КонецЕСлИ;	
	//КонецЦикла;
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.Заполнить(ТранспортныйМаршрут);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_Экспедиция")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

// << Горбунов, пересчитаем процент
&НаКлиенте
Процедура ЗаказыРасходыПриИзменении(Элемент)
	Элементы.Заказы.ТекущиеДанные.Доля = Окр(Элементы.Заказы.ТекущиеДанные.Расходы/Объект.СуммаСчетаТК*100);
КонецПроцедуры
// >> Горбунов

//\\\\\\\\\КОНЕЦ (1)\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
